import React, { SVGProps } from 'react';

export default (props: SVGProps<SVGSVGElement>) => (
  <svg
    width="16px"
    height="16px"
    viewBox="0 0 16 16"
    version="1.1"
    xmlns="http://www.w3.org/2000/svg"
    xmlnsXlink="http://www.w3.org/1999/xlink"
    {...props}
  >
    <g
      id="1.Base基础组件/Icon图标/系统/file/ZIP"
      stroke="none"
      strokeWidth="1"
      fill="none"
      fillRule="evenodd"
    >
      <g id="file-ZIP" fillRule="nonzero">
        <path
          d="M10,0 L10,2 C10,3.1045695 10.8954305,4 12,4 L14,4 L14,14 C14,15.1045695 13.1045695,16 12,16 L4,16 C2.8954305,16 2,15.1045695 2,14 L2,2 C2,0.8954305 2.8954305,0 4,0 L10,0 Z"
          id="形状结合"
          fill="#E9ECF0"
        ></path>
        <path
          d="M12,2 L10,0 L12,0 C13.1045695,0 14,0.8954305 14,2 L14,4"
          id="路径"
          fill="#DADCE0"
          transform="translate(12.000000, 2.000000) rotate(180.000000) translate(-12.000000, -2.000000) "
        ></path>
        <rect
          id="矩形"
          fill="#C8694D"
          x="0"
          y="7"
          width="16"
          height="6"
          rx="1"
        ></rect>
        <g id="ZIP" transform="translate(3.862500, 8.055000)" fill="#FFFFFF">
          <polygon
            id="路径"
            points="3.175 3.49 3.175 4.145 0 4.145 0 3.665 2.155 0.66 0.145 0.66 0.145 0 3.145 0 3.145 0.485 0.99 3.49"
          ></polygon>
          <polygon
            id="路径"
            points="4.645 0 4.645 4.145 3.86 4.145 3.86 0"
          ></polygon>
          <path
            d="M8.33,1.35 C8.33,1.61666667 8.27333333,1.85166667 8.16,2.055 C8.04666667,2.25833333 7.8875,2.41666667 7.6825,2.53 C7.4775,2.64333333 7.24,2.7 6.97,2.7 L6.235,2.7 L6.235,4.145 L5.45,4.145 L5.45,0 L6.97,0 C7.24,0 7.4775,0.0566666667 7.6825,0.17 C7.8875,0.283333333 8.04666667,0.441666667 8.16,0.645 C8.27333333,0.848333333 8.33,1.08333333 8.33,1.35 Z M7.545,1.35 C7.545,1.11333333 7.48,0.931666667 7.35,0.805 C7.22,0.678333333 7.035,0.615 6.795,0.615 L6.235,0.615 L6.235,2.085 L6.795,2.085 C7.035,2.085 7.22,2.02166667 7.35,1.895 C7.48,1.76833333 7.545,1.58666667 7.545,1.35 Z"
            id="形状"
          ></path>
        </g>
      </g>
    </g>
  </svg>
);
