import React from 'react';

import type { SVGProps } from 'react';

export default (props: SVGProps<SVGSVGElement>) => (
  <svg
    width="16px"
    height="16px"
    viewBox="0 0 16 16"
    version="1.1"
    xmlns="http://www.w3.org/2000/svg"
    xmlnsXlink="http://www.w3.org/1999/xlink"
    {...props}
  >
    <g
      id="页面-1"
      stroke="none"
      strokeWidth="1"
      fill="none"
      fillRule="evenodd"
      fillOpacity="0.35"
    >
      <g
        id="ISV管理-新增ISV企业"
        transform="translate(-385.000000, -576.000000)"
        fill="#08101E"
      >
        <g id="编组-6" transform="translate(284.000000, 503.000000)">
          <g
            id="4.Input输入/14.Upload上传/1.基础/上传成功备份-5"
            transform="translate(0.000000, 30.000000)"
          >
            <g id="-mockplus-" transform="translate(101.000000, 43.000000)">
              <g
                id="Base基础组件/Icon图标/反馈/error-circle-filled"
                transform="translate(1.500000, 1.500000)"
              >
                <path
                  d="M6.5,0 C7.56521406,0 8.59476925,0.256955244 9.51810124,0.74181222 C10.099699,1.04721885 10.6318519,1.43944771 11.0962266,1.90382114 C12.3069173,3.11458874 13,4.75320784 13,6.5 C13,8.2468189 12.3069188,9.88544042 11.0962013,11.0962248 C9.88544042,12.3069188 8.2468189,13 6.5,13 C4.75320784,13 3.11458874,12.3069173 1.90380699,11.0962125 C0.693076631,9.88547876 0,8.24685795 0,6.5 C0,4.75316879 0.693078138,3.1145504 1.90380994,1.90380522 C3.1145504,0.693078138 4.75316879,0 6.5,0 Z M8.87089499,3.21210491 L6.512,5.57 L4.15449276,3.21210491 L3.21404074,4.15255693 L5.572,6.51 L3.21404074,8.86895916 L4.15449276,9.80941118 L6.512,7.451 L8.87089499,9.80941118 L9.81134701,8.86895916 L7.453,6.51 L9.81134701,4.15255693 L8.87089499,3.21210491 Z"
                  id="形状结合"
                ></path>
              </g>
            </g>
          </g>
        </g>
      </g>
    </g>
  </svg>
);
